Tekla Open API Reference for Tekla Structures 2025
PrimaryPart Methods
The PartFilterExpressions.PrimaryPart type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
PartFilterExpressions.PrimaryPart Class
Tekla.Structures.Filtering.Categories Namespace